InformationRegisters/ПереводыТекстов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПереводыТекстов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстRU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстUK</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ХешRU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХешUK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПереводыТекстов/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
		
		НовыйХешRU = ЛокализацияПовтИсп.ПолучитьХешСтроки(ЗаписьНабора.ТекстRU);
		НовыйХешUK = ЛокализацияПовтИсп.ПолучитьХешСтроки(ЗаписьНабора.ТекстUK);
		Если НЕ ЗначениеЗаполнено(ЗаписьНабора.УИД) Тогда
			НовыйУИД = Новый УникальныйИдентификатор();
		Иначе
			НовыйУИД = ЗаписьНабора.УИД;
		КонецЕсли; 
		
		Если НовыйХешRU <> ЗаписьНабора.ХешRU ИЛИ НовыйХешUK <> ЗаписьНабора.ХешUK ИЛИ НовыйУИД <> ЗаписьНабора.УИД Тогда
			
			ЗаписьНабора.ХешRU = НовыйХешRU;
			ЗаписьНабора.ХешUK = НовыйХешUK;
			ЗаписьНабора.УИД   = НовыйУИД;
			
			Если ЭтотОбъект.Отбор.ХешRU.Использование Тогда
				ЭтотОбъект.Отбор.ХешRU.Установить(НовыйХешRU);
			КонецЕсли; 
			
			Если ЭтотОбъект.Отбор.ХешUK.Использование Тогда
				ЭтотОбъект.Отбор.ХешUK.Установить(НовыйХешUK);
			КонецЕсли; 
			
			Если ЭтотОбъект.Отбор.УИД.Использование Тогда
				ЭтотОбъект.Отбор.УИД.Установить(НовыйУИД);
			КонецЕсли; 
			
		КонецЕсли;	
		
	КонецЦикла;
		
КонецПроцедуры // ПередЗаписью


Процедура ПриЗаписи(Отказ, Замещение)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры
